"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

function salary(salarySize) {
    if (isNaN(salarySize)) {
        console.log("Значение задано неверно");
    } else {
        const result = salarySize - (salarySize * 0.13);
        console.log(`Размер заработной платы за вычетом налогов равен ${result.toFixed(2)}`);
    }
}

const salarySize = Number.parseFloat(prompt('Введите размер зарплаты: '));
salary(salarySize);
