"use strict";

/*
Используя Math.random() необходимо сгенерировать массив, содержащий 5 цифр в 
диапазоне [0, 9].
После создания массива необходимо вывести в консоль следующие значения:
1. Сумму элементов массива
2. Минимальное значение в массиве
3. Новый массив, содержащий индексы сгенерированного выше массива, в которых 
значение равно 3.
Пример: Если у нас сгенерировался массив [2, 3, 5, 7, 3], то мы должны вывести 
в консоль массив [1, 4]. Такой массив получился потому что в сгенерированном
массиве тройки лежат под индексами 1 и 4. Если троек в сгенерированном массиве
не окажется, значит нужно будет вывести пустой массив.
*/

const num = Array.from({ length: 5 }, () => Math.floor(Math.random() * 9 + 1));
console.log(num);

// 1

let sum1 = 0;
num.forEach(element => {
    sum1 += element;
});
console.log(`Сумма элементов массива: ${sum1}`);

const sum2 = num.reduce((sum, number) => sum + number, 0);
console.log(`Сумма элементов массива: ${sum2}`);

// 2

console.log(`Минимальное значение в массиве: ${Math.min(...num)}`);

//3

const newNum = [];
for (let index = 0; index < num.length; index++) {
    if (num[index] === 3){
        newNum.push(index);  
    }   
}
console.log(newNum);
